---
title: StructuralSectionHotRolled
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# StructuralSectionHotRolled

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double FlangeThickness { get; set; }` | `structuralSectionHotRolled.FlangeThickness` | Double |
| `Double FlangeThicknessLocation { get; set; }` | `structuralSectionHotRolled.FlangeThicknessLocation` | Double |
| `Double WebFillet { get; set; }` | `structuralSectionHotRolled.WebFillet` | Double |
| `Double WebThickness { get; set; }` | `structuralSectionHotRolled.WebThickness` | Double |
| `Double WebThicknessLocation { get; set; }` | `structuralSectionHotRolled.WebThicknessLocation` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```